#-------------------------------------------------------------
# 1D edge interpolation
#-------------------------------------------------------------
function ϕ_iedge(ϕ_val_and_derivs, t, i, p)
  ϕᵢ, ∂ϕ_∂ξᵢ, ∂²ϕ_∂ξ²ᵢ = ϕ_val_and_derivs(t, i, p)
  ϕᵢ₊₁, ∂ϕ_∂ξᵢ₊₁, ∂²ϕ_∂ξ²ᵢ₊₁ = ϕ_val_and_derivs(t, i + 1, p)

  ϕᴸᵢ₊½ = ϕᵢ + (1 / 2) * ∂ϕ_∂ξᵢ + (1 / 12) * ∂²ϕ_∂ξ²ᵢ
  ϕᴿᵢ₊½ = ϕᵢ₊₁ - (1 / 2) * ∂ϕ_∂ξᵢ₊₁ + (1 / 12) * ∂²ϕ_∂ξ²ᵢ₊₁

  return (ϕᴸᵢ₊½ + ϕᴿᵢ₊½) / 2
end

#-------------------------------------------------------------
# 2D edge interpolation
#-------------------------------------------------------------
function ϕ_iedge(ϕ_val_and_derivs, t, i, j, p)
  ϕᵢ, ∂ϕ_∂ξᵢ, ∂²ϕ_∂ξ²ᵢ = ϕ_val_and_derivs(t, i, j, p)
  ϕᵢ₊₁, ∂ϕ_∂ξᵢ₊₁, ∂²ϕ_∂ξ²ᵢ₊₁ = ϕ_val_and_derivs(t, i + 1, j, p)

  ϕᴸᵢ₊½ = ϕᵢ + (1 / 2) * ∂ϕ_∂ξᵢ + (1 / 12) * ∂²ϕ_∂ξ²ᵢ
  ϕᴿᵢ₊½ = ϕᵢ₊₁ - (1 / 2) * ∂ϕ_∂ξᵢ₊₁ + (1 / 12) * ∂²ϕ_∂ξ²ᵢ₊₁

  return (ϕᴸᵢ₊½ + ϕᴿᵢ₊½) / 2
end

function ϕ_jedge(ϕ_val_and_derivs, t, i, j, p)
  ϕᵢ, ∂ϕ_∂ξᵢ, ∂²ϕ_∂ξ²ᵢ = ϕ_val_and_derivs(t, i, j, p)
  ϕᵢ₊₁, ∂ϕ_∂ξᵢ₊₁, ∂²ϕ_∂ξ²ᵢ₊₁ = ϕ_val_and_derivs(t, i, j + 1, p)

  ϕᴸᵢ₊½ = ϕᵢ + (1 / 2) * ∂ϕ_∂ξᵢ + (1 / 12) * ∂²ϕ_∂ξ²ᵢ
  ϕᴿᵢ₊½ = ϕᵢ₊₁ - (1 / 2) * ∂ϕ_∂ξᵢ₊₁ + (1 / 12) * ∂²ϕ_∂ξ²ᵢ₊₁

  return (ϕᴸᵢ₊½ + ϕᴿᵢ₊½) / 2
end

#-------------------------------------------------------------
# 3D edge interpolation
#-------------------------------------------------------------
function ϕ_iedge(ϕ_val_and_derivs, t, i, j, k, p)
  ϕᵢ, ∂ϕ_∂ξᵢ, ∂²ϕ_∂ξ²ᵢ = ϕ_val_and_derivs(t, i, j, k, p)
  ϕᵢ₊₁, ∂ϕ_∂ξᵢ₊₁, ∂²ϕ_∂ξ²ᵢ₊₁ = ϕ_val_and_derivs(t, i + 1, j, k, p)

  ϕᴸᵢ₊½ = ϕᵢ + (1 / 2) * ∂ϕ_∂ξᵢ + (1 / 12) * ∂²ϕ_∂ξ²ᵢ
  ϕᴿᵢ₊½ = ϕᵢ₊₁ - (1 / 2) * ∂ϕ_∂ξᵢ₊₁ + (1 / 12) * ∂²ϕ_∂ξ²ᵢ₊₁

  return (ϕᴸᵢ₊½ + ϕᴿᵢ₊½) / 2
end

function ϕ_jedge(ϕ_val_and_derivs, t, i, j, k, p)
  ϕᵢ, ∂ϕ_∂ξᵢ, ∂²ϕ_∂ξ²ᵢ = ϕ_val_and_derivs(t, i, j, k, p)
  ϕᵢ₊₁, ∂ϕ_∂ξᵢ₊₁, ∂²ϕ_∂ξ²ᵢ₊₁ = ϕ_val_and_derivs(t, i, j + 1, k, p)

  ϕᴸᵢ₊½ = ϕᵢ + (1 / 2) * ∂ϕ_∂ξᵢ + (1 / 12) * ∂²ϕ_∂ξ²ᵢ
  ϕᴿᵢ₊½ = ϕᵢ₊₁ - (1 / 2) * ∂ϕ_∂ξᵢ₊₁ + (1 / 12) * ∂²ϕ_∂ξ²ᵢ₊₁

  return (ϕᴸᵢ₊½ + ϕᴿᵢ₊½) / 2
end

function ϕ_kedge(ϕ_val_and_derivs, t, i, j, k, p)
  ϕᵢ, ∂ϕ_∂ξᵢ, ∂²ϕ_∂ξ²ᵢ = ϕ_val_and_derivs(t, i, j, k, p)
  ϕᵢ₊₁, ∂ϕ_∂ξᵢ₊₁, ∂²ϕ_∂ξ²ᵢ₊₁ = ϕ_val_and_derivs(t, i, j, k + 1, p)

  ϕᴸᵢ₊½ = ϕᵢ + (1 / 2) * ∂ϕ_∂ξᵢ + (1 / 12) * ∂²ϕ_∂ξ²ᵢ
  ϕᴿᵢ₊½ = ϕᵢ₊₁ - (1 / 2) * ∂ϕ_∂ξᵢ₊₁ + (1 / 12) * ∂²ϕ_∂ξ²ᵢ₊₁

  return (ϕᴸᵢ₊½ + ϕᴿᵢ₊½) / 2
end